{
  "name": "MOHAMMAD MIRZAEI",
  "role": "Backend-Entwickler",
  "contact": "Düren\nNimamirzaei65@gmail.com\n+49 (0) 1573 0187 245\nlinkedin.com/in/nimamirzaei\n",
  "summary": "Software Engineer mit über 5 Jahren Erfahrung in IT-Infrastruktur und Backend-Entwicklung. Fundierte Kenntnisse in Linux-basierten Systemen und Netzwerken sowie in der Entwicklung produktiver Backend-Services mit Golang und Laravel (PHP). Einbindung in Backend- und API-Tests im Entwicklungsprozess mittels PHPUnit, Postman sowie manueller Tests zur Validierung von Funktionen und Endpunkten. Erfahrung im Design von RESTful APIs, relationalen Datenbanken und Docker-basierten Entwicklungs- und Deployment-Workflows. Qualitätsorientierte Arbeitsweise mit solidem Verständnis von Systemarchitektur, Sicherheitsgrundlagen und Produktionsbetrieb.",
  "exp1_title": "Entwickler — Fleetpool GmbH",
  "exp1_meta": "Köln, Deutschland · Juni 2020 – heute · Golang · Laravel (PHP) · Docker · PostgreSQL · MySQL",
  "exp1_bullets": "• Entwicklung und Wartung von Backend-Services mit Golang und Laravel (PHP) in produktiven Umgebungen.\n• Containerisierung von Backend-Services mit Docker zur Standardisierung von Entwicklungs- und Deployment-Prozessen.\n• Konzeption und Optimierung von RESTful APIs für Webanwendungen.\n• Design und Verwaltung relationaler Datenbanken (PostgreSQL, MySQL).\n• Performance-Verbesserungen durch Query-Optimierung und saubere Architekturprinzipien.\n• Umsetzung von Authentifizierung, Autorisierung und rollenbasierter Zugriffskontrolle.\n• Durchführung grundlegender Backend- und API-Tests als Teil des Entwicklungsprozesses.\n• Erstellung und Ausführung von Unit-Tests für PHP-Komponenten mit PHPUnit.\n• Manuelle Tests von Backend-Funktionalitäten und Geschäftslogik vor Releases.\n• Nutzung von Postman zur Validierung von REST-API-Endpunkten, Request/Response-Payloads und Fehlerbehandlung.\n• Enge Zusammenarbeit mit funktionsübergreifenden Teams zur frühzeitigen Fehlererkennung und -behebung.",
  "exp2_title": "Senior Network Engineer / Junior Web Application Developer — NIGC Arak",
  "exp2_meta": "Arak, Iran · Juni 2016 – Nov. 2019 · ASP.NET Core · C# · MSSQL · Angular · Networking/Security",
  "exp2_bullets": "• Entwicklung interner Webanwendungen mit ASP.NET Core, C#, MSSQL, Angular, HTML und CSS.\n• Planung und Betrieb von Unternehmensnetzwerken und Sicherheitsinfrastrukturen.\n• Konfiguration und Troubleshooting von Routern, Switches und UTM-Systemen.\n• Umsetzung von Network Access Control für Hauptsitz und Niederlassungen.",
  "exp3_title": "Senior Network Engineer — Shabakeh Gostar",
  "exp3_meta": "Teheran, Iran · Nov. 2013 – Juni 2016 · Sophos UTM · Firewalls · VPN · IPS · Data Center Security",
  "exp3_bullets": "• Beratung zu Netzwerk- und Sicherheitsarchitekturen in Rechenzentren in Multi-Vendor-Umgebungen.\n• Design und Implementierung von Firewall-, VPN-, IPS- und Web-Sicherheitslösungen.\n• Rollout und Support von Sophos-UTM-Geräten bei Kunden.\n• Mitarbeit an Dokumentation und Kundenschulungen.",
  "exp4_title": "Frühere Tätigkeiten — Technischer Support & IT-Support",
  "exp4_meta": "Iran · Feb. 2008 – Nov. 2013 · Networking · System Support · CCTV-Infrastruktur",
  "exp4_bullets": "• Technischer Leiter (Rayan Karan Hami): Planung und Umsetzung von CCTV-Systemen; Aufbau und Wartung von Recording-Servern und Netzwerkinfrastruktur.\n• IT Support Specialist (Jahan Farda Rayane): Betrieb von Cisco-Switches und LAN-Umgebungen; Analyse und Behebung von Hard- und Software- sowie Netzwerkproblemen.\n• Helpdesk-Mitarbeiter (Notariat Nr. 10, Teilzeit): First-Level-IT-Support; Installation und Reparatur von Computer-Hard- und Software.",
  "skills": "• Backend: Golang, PHP (Laravel), ASP.NET Core, C#\n• Datenbanken: PostgreSQL, MySQL, MSSQL\n• Container: Docker, Docker Compose\n• Systeme: Linux, Git\n• Web: REST APIs, Angular, HTML, CSS\n• Testing (im Rahmen der Entwicklung): PHPUnit, Postman, manuelle Backend- & API-Tests\n• Security & Networking: Firewalls, VPN, Cisco, Sophos UTM",
  "edu_text": "• B.Sc. Computer Software Engineering\n• Islamic Azad University (IAU) · 2008 – 2012",
  "languages": "• Englisch (fließend)\n• Deutsch (B2)\n• Persisch (Muttersprache)",
  "certifications_training": "• telc Deutsch B2\n• Professional Scrum Master I\n• PHP Tutorial Course\n• CCNA\n• CCNP Routing & Switching\n• LPIC-1\n• Golang"
}
